In [1]:
import pandas as pd
import numpy as np

In [25]:
m, n = 6, 2
df = pd.DataFrame(np.random.randint(100,size=(m, n)))

In [26]:
df

    0   1
0  10  76
1  67  59
2  28  42
3  64  87
4  78  38
5  55  94

In [28]:
window_size = 2
df.transform(lambda x: x.rolling(window_size).max())

      0     1
0   NaN   NaN
1  67.0  76.0
2  67.0  59.0
3  64.0  87.0
4  78.0  87.0
5  78.0  94.0

In [31]:
df.shift(periods=3)

      0     1
0   NaN   NaN
1   NaN   NaN
2   NaN   NaN
3  10.0  76.0
4  67.0  59.0
5  28.0  42.0

In [30]:
df.shift(periods=3).transform(lambda x: x.rolling(window_size).max())

      0     1
0   NaN   NaN
1   NaN   NaN
2   NaN   NaN
3   NaN   NaN
4  67.0  76.0
5  67.0  59.0